'''
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
'''
n = input("Введите трехзначное число -> ")
count = 0
for i in range (len(n)):
    count = count + int(n[i])
print(count)