'''
Задача 26: Напишите программу, которая на вход принимает
два числа A и B, и возводит число А в целую степень B с
помощью рекурсии.
A = 3; B = 5 -> 243 (3⁵)
A = 2; B = 3 -> 8
'''


def power(x,n):
    if n == 0:
        return 1
    if n < 0: # усли степень будет отрицательной
        return 1 / power(x, -n)
    if n %2 == 0:
        return power (x, n // 2) * power(x, n // 2)
    else:
        return power(x, n-1) * x

a = int(input())
b = int(input())
print(power(a, b))